package com.traffic.authentication.enums;

public enum ErrorEnum implements CodeBaseEnum  {
    SC(-1, "自定义操作"),
    SC0(0, "成功"),
    FL1(1, "失败"),
    FL2(2, "网络繁忙,请稍后重试"),
    FL3(3, "参数错误"),
    FL4(4, "手机号格式不正确"),
    FL5(5, "验证码无效"),
    FL6(6, "会话已过期，请重新登录"),
    FL7(7, "邀请码无效"),
    FL8(8, "新密码不能和旧密码一样"),
    FL9(9, "用户名或密码错误"),
    FL10(10, "操作过于频繁，请稍候再试"),
    FL11(11, "手机号不存在"),
    FL12(12, "手机号已存在，请直接登录"),
    FL13(13, "记录不存在"),
    FL14(14, "用户不存在"),
    FL15(15, "无效的token"),
    FL16(16, "原密码不正确"),
    FL17(17, "用户已被冻结"),
    FL18(18, "用户名已存在"),
    FL19(19, "密码不正确"),
    FL20(20, "当前操作有误"),
    FL21(21, "非当前系统用户"),
    FL22(22, "不存在当前操作类型"),
    FL23(23, "气瓶状态不满足当前操作"),
    FL24(24, "气瓶不存在"),
    FL25(25, "权限不足,请联系管理员"),
    FL26(26, "请求参数不能为空"),
    FL27(27, "气瓶已存在"),
    FL28(28, "验证码发送失败"),
    FL29(29, "验证码错误"),
    FL30(30, "请检查必填选项"),
    FL31(31, "绑定手机号失败"),
    THIRD(300, "第三方接口错误"),
    FL32(32, "图片/文件上传失败"),
    FL33(33, "二维码已有关联气瓶"),
    FL444(444, "失败"),



    MEMBER_01(4001,"客户信息不存在"),
    MEMBER_02(4002,"客户账号信息已存在"),
    MEMBER_03(4003,"代理创建客户信息失败"),
    MEMBER_04(4004,"客户信息已经存在"),
    MEMBER_05(4005,"您当前还未实名"),
    MEMBER_06(4006,"客户地址不存在"),

    SIGN_01(5001,"签到失败,车牌号不能为空"),
    SIGN_02(5002,"签到失败,车牌号不存在"),
    SIGN_03(5003,"签到失败,车牌号已绑定"),
    SIGN_07(5007,"签到失败,车辆未归还不能更换车辆"),
    SIGN_04(5004,"已签到"),
    SIGN_05(5005,"已签退"),
    SIGN_06(5006,"未签退"),

    TRANSIT_01(6001, "订单信息不存在"),
    TRANSIT_02(6002, "配送单已被其他配送员抢单"),
    TRANSIT_03(6003, "配送单不存在"),
    TRANSIT_04(6004, "请上传用户证照"),
    TRANSIT_05(6005, "请上传用气环境照"),
    TRANSIT_06(6006, "请上传用气环境照2"),
    TRANSIT_07(6007, "请上传旧瓶照"),
    TRANSIT_08(6008, "请扫描瓶身码"),
    TRANSIT_09(6009, "请先支付订单"),
    TRANSIT_10(6010, "订单未支付"),
    TRANSIT_11(6011, "订单已取消"),
    TRANSIT_12(6012, "订单状态异常，不允许重新派单"),
    TRANSIT_13(6013, "订单无需支付"),
    TRANSIT_14(6014, "订单状态异常"),

    ORDER_01(7001, "下单失败"),
    ORDER_02(7002, "无法找到对应规格的气瓶"),
    ORDER_03(7003, "订单不存在"),
    ORDER_04(7004, "请填写收货人姓名"),
    ORDER_05(7005, "请填写收货人手机号"),
    ORDER_06(7006, "未找到商品价格"),
    ORDER_07(7007, "退款数量超过押金数量，申请失败"),
    ORDER_08(7008, "请输入自提地址"),
    ORDER_09(7009, "下单失败：用户收货地址不正确"),
    ORDER_10(7010, "下退单失败：仅押金单允许退单"),
    ORDER_11(7011, "下退单失败：商品信息失败"),
    ORDER_12(7012, "下退单失败：未找到押金信息"),
    ORDER_13(7013, "下退单失败：冻结用户押金库存失败"),
    ORDER_14(7014, "订单状态异常"),
    ORDER_15(7015, "下单失败：商品不存在或已下架"),
    ORDER_16(7016, "取消订单失败：还在用户确认环境时间段内，无法取消"),
    ORDER_17(7017, "订单状态异常"),
    ORDER_18(7018, "核销失败：凭证不正确"),
    ORDER_19(7019, "支付失败"),
    ORDER_20(7020, "储值卡余额不足,请更换支付方式"),
    ORDER_21(7021, "订单未完成不允许退押金"),
    //通联用户异常
    TL_MEMBER_1(4101,"创建用户失败"),
    TL_MEMBER_2(4102,"用户信息不存在"),
    TL_MEMBER_3(4103,"用户实名失败"),
    TL_MEMBER_4(4104,"绑定手机号失败"),
    TL_MEMBER_5(4105,"绑定银行卡失败"),
    TL_MEMBER_6(4106,"会员子账号开通失败"),
    TL_MEMBER_7(4107,"发送短信验证码失败"),
    TL_MEMBER_8(4108,"会员电子协议签约失败"),
    TL_MEMBER_9(4109,"设置企业信息失败"),
    TL_MEMBER_10(4110,"锁定用户失败"),
    TL_MEMBER_11(4111,"本地缓存企业信息失败"),
    TL_MEMBER_12(4112,"创建企业信息失败"),
    TL_MEMBER_13(4113,"影印件采集信息失败"),
    TL_MEMBER_14(4114,"您暂时未在通商云注册,请联系工作人员"),
    TL_MEMBER_15(4115,"您还未实名,不能进行电子签约"),
    TL_MEMBER_16(4116,"该账号不是您的财务人员"),


    PRODUCT_01(8001, "商品信息不存在"),
    PRODUCT_02(8002, "不能重复添加商品"),


    PRODUCT_STOCK_01(8101, "商品库存增加失败"),
    PRODUCT_STOCK_02(8102, "商品库存扣减失败"),
    PRODUCT_STOCK_03(8103, "商品库存不足"),

    CAR_01(9001,"车辆已存在"),
    MINI_LOGIN_TIMEOUT(10001,"微信授权过期，请用户重新授权登录"),
    MINI_FAILED_TO_GET_OPEN_ID(10002,"获取微信OPEN_ID失败"),

    ROLE_01(11001,"此角色不能删除"),

    DATA_01(12001,"数据为空")
    ;

    private int code;

    private String msg;

    ErrorEnum(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public static ErrorEnum getEnum(int code) {
        for (ErrorEnum ele : ErrorEnum.values()) {
            if (ele.code() == code) {
                return ele;
            }
        }
        return null;
    }

    @Override
    public String msg() {
        return msg;
    }

    @Override
    public int code() {
        return code;
    }
}
